module.exports.config = {
	name: "caption",
	version: "1.0.1",
	role: 0,
	author: "SK-SIDDIK-KHAN", 
	description: "",
   category: "caption",
	usages: "user",
	countDowns: 5,
	dependencies: {
		"request":  ""
	}
};

module.exports.onStart = async ({ api, event}) => {
  const { threadID, messageID, senderID } = event;
     async function getUserInfo(userID) {
            const userInfo = await api.getUserInfo(userID);
            return {gender: userInfo[userID].gender };
     }
    const gai = ["আমার মন কে এই ভাবে বন্দি কোরো না পাগলী। আমি মনের রাজা, তোমার খাঁচায় বন্দি পাখী নয়।”",
 
                  "“এক দিন লক্ষ্য করি, আমি বিনা কারণেই হাসছি, তখন বুঝতে পারি আমি তোমাকে ভালোবেসে ফেলেছি।”",
 
                  "“কখনও অভিমান কোরো না, কারণ আমি অভিমানী কে মানাতে জানি না।”",
 
                  "“তোর ভালোবাসায় আমার অধিকার তো নেই, কিন্তু আমার মন বলে আমি তোর জন্য সারা জীবন অপেক্ষা করতে পারব।”",
 
                  "“প্রেম এমন একটা ফল, যা সব ঋতুতেই ফলে এবং সবাই পায়।”",
 
                  "“প্রেম হাসি দিয়ে শুরু হয়, এজন্য আমাদের হাসি মুখে সবার সাথে দেখা করা উচিত।”",
 
                  "“যদি কেউ, প্রতি দিন সকালে ওঠার পরে এবং রাতে ঘুমানোর আগে তোমার কথা মনে করে, তাহলে তুমি বুঝবে, তুমি তার জন্য খুব স্পেশাল।”",
 
                  "“জীবনের সমস্ত মুশকিল আসান করার জন্য আমার কেবল মাত্র একটি জিনিস প্রয়োজন, আর সেটা হলো তোমার মিষ্টি হাসি।”",
 
                  "“এই কথাটা শুনতে কতই না ভালো লাগে, যখন কেউ খুব ব্যস্ত হওয়ার পরেও বলে, তোমার থেকে জরুরি আর কিছু নেয় আমার জীবনে।”",
 
                  "“যখন আমার কিছু বলার আগেই তুমি বুঝে যাও, তখন তোমার প্রতি একটু বেশিই ভালোবাসা অনুভব করি।”",
 
                  "“লোক বদলায়, পরিস্থিথি বদলায়, প্রেমিক প্রেমিকা বদলায়, কিন্তু প্রেম কখনো বদলায় না।”",
 
                  "“কাউকে আপন করে পাওয়া প্রেম নয়, প্রেম হল আপন জনের মনে জায়গা করে নেওয়া।”",
 
                  "“সেই সময় দুনিয়া কতই না সুন্দর হয়ে যায়, যখন কোনো আপন জন বলে, তোমার কথা খুব মনে পরে।”",
 
                  "“তোমার ভালোবাসায় ডুবে বৃষ্টির ফোঁটা থেকে সাগর হয়ে যাব, তোমা থেকে শুরু হয়ে তোমাতেই শেষ হয়ে যাব।”",
 
                  "” প্রেমই জীবন। প্রেম হারিয়ে ফেললে তুমি সব কিছু হারিয়ে ফেলবে।”",
 
                  "“তুমি ভালোবাসা না ঈশ্বরের দান, ঠিক বুঝতে পারি না, একটা সুন্দর অনুভূতি, যা মন থেকে যায় না।”",
 
                  ". “ভালোবাসা কি? তা আমি জানতাম না। হঠাৎ একদিন তোমাকে দেখলাম, আর হারিয়ে গেলাম।”",
 
                  "শোনো পাগলী, তোমার জন্য চিন্তা করি, সন্দেহ নয়। তোমাকে অন্য কেউ দেখে, তা বরদাস্ত নয়।”",
 
                "“ভালোবাসার মানে এই নয় যে, তোমার কোনো গার্লফ্রেন্ড বা বয়ফ্রেন্ড থাকবে, ভালোবাসা মানে এক জন কেউ স্পেশাল থাকবে, যার জন্য তুমি চিন্তা করবে এবং সে তোমার জন্য চিন্তা করবে।”",
 
                  "“আমার ইচ্ছা অনেক, কিন্তু প্রয়োজন শুধু তোমাকে।”",
 
                  "“আমি প্রেম, তুই জেদ, আমি তোর মধ্যে, তুই আমার মধ্যে।”",
 
                  "“একটু শোনো, তোমার সাথে কাটানো প্রতিটা মিষ্টি মুহূর্ত এখনো আমার চোখে ভাসে, এই মুহূর্তগুলো ততদিন থাকবে যতদিন আমার চোখ খোলা থাকবে।”",
 
                  "“শোনো, তুমি মিছিমিছি আমার উপর অভিমান কোরো না, জানো তো, তুমি ছাড়া আমার কোনো অস্তিত্ব নেয়।”",
                  
                  "“তোমার চিন্তা আমার মন থেকে কখনই যাবে না, কারণ তুমি আমার চিন্তার চিন্তায় মিশে আছো।”",
 
                  "“ঈশ্বরের কাছে কেবল একটাই প্রার্থনা, যেন যখনই চোখ খুলি তোমাকেই দেখি সব জায়গা।”",
 
                  "“যখন থেকে পরী হয়ে বাসা বেধেঁছ আমার চোখে, তখন থেকে তুমি ছাড়া আর কিছুই ভালো লাগেনা।”",
 
                  "“এক মাত্র মন টাই তো ছিল আমার, তুমি সেটা কেও চুরি করে নিলে।”",
 
                  "“আবার যদি পৃথিবীতে বাঁচার সুযোগ পায়, তবে এবার তোমার নাম আমার হাতের রেখায় আগে থেকে লিখিয়ে নিয়ে পৃথিবীতে আসব।”",
 
                  "“যতই না মোবাইলে কথা বলো আর চ্যাট করো, মনের খিদে তখনই মিটে যখন দেখি তোমাকে আমার চোখের সামনে।”",
 
                  "“হাতটা ধরো আমার শক্ত করে, এই দুনিয়াতে হারিয়ে না যায়, এ দায়িত্ব তোমারি আছে।”",
 
                  "“এই চোখ দিয়ে পান করে নিই, মনের কারাগারে তোকে বন্দি করে নিই, আমার চোখের মনি তুই, আয় তোকে সবার আড়াল করে নিই।”",
 
                  "“তোর আমার Love story এমন হোক যেন Id তোর কিন্তু Dp আমার।”",
 
                  "“না চাঁদ চাই, না সূর্য চাই, শুধু তোর এক ঝলক চাই।”",
 
                  "“ছোট ছোট ব্যাপার নিয়েও অনেক বকাবকি করতিস তুই, আমি চুপ করে শুনতাম, তার মানে এই নয় যে দোষটা আমার ছিল, একটা সময় ছিল, যখন তোর কথা শুনলে আমার মনটা জুড়িয়ে যেত।”",
    ];
    const trai = ["আজ আমার এই চোখের জল হয়তো কারো জন্য ঠাট্টার খোরাক, কিন্তু তা বেরিয়ে পরে প্রতিটা নিঃশাসের সাথে যেন জ্বলন্ত চিতার অগ্রিম ছাই।”",
 
                  "“হয়তো তুই, জীবনে আমার থেকেও ভালো কাউকে পেয়েছিস, বা কেউ হয়তো তোকেও কোনোদিন কাঁদিয়েছে ঠিক আমি যেমন কাঁদছি। কিন্তু কথা দিচ্ছি, তোর চোখের জলের প্রতিটা বিন্দুর মূল্য ভালোবাসা দিয়ে চোকাবো আমি।”",
 
                  "“তুই মৃত্যুর সাজা দিলে, তোর খুশির জন্য আমি হাসতে হাসতে মৃত্যুকে জড়িয়ে ধরবো।”",
 
                  "“যতই অভিমান কর তুই, তোর প্রতি আমার ভালোবাসা কোনো দিনই কম হবে না। আমার মতো তোর সাথে কেউ থাকবে, এমন কোনো জীবন সাথী পাবি না।”",
 
                  "“তোর ছোট্ট ছোট্ট অভিমান আমাকে খুব কষ্ট দিয়ে কাঁদাচ্ছে, আর তুই আমার হবি না – তা আমাকে মৃত্যুর দিকে ঠেলে দিচ্ছে।”",
 
                  "“বলা হয়, প্রতিটা সম্পর্কের একটা শক্তি থাকে, যার জন্য তারা একে ওপরের ওপর ভরসা করে। কিন্তু এই ভরসা যদি সন্দেহে পরিণত হয়, তখন এই শক্তিই দূর্বলতায় পরিণত হয়।”",
 
                  "“আমি গর্ব অনুভব করতাম সবার কাছে তোর কথা বলে, কিন্তু এক মুহূর্তও তোর প্রয়োজন মনে হলো না আমার Care করার জন্য।”",
 
                  "“মানুষ ততক্ষন পরিপূর্ণ হয় না, যতক্ষণ না তার বিয়ে হয়,…তার পর সে শেষ হয়ে যায়।”",
                  
                  "ভালবাসা বলতে আমি বুজি জীবন  খুব ভালো ছেলে অর সাথে প্রেম করতে পারেন পোলাটার সাথে",                 
 ];
var mention = Object.keys(event.mentions);
   const data = await getUserInfo(senderID);
  if (Object.keys(event.mentions).length == 1) {
    if (data.gender == 2 ) {
        api.sendMessage(`Gửi lời thả thính đến ${event.mentions[on].replace("@", "")}:\n${trai[Math.floor(Math.random() * trai.length)]}`,threadID, messageID);
    }
    if (data.gender == 1 ) {
        api.sendMessage(`Gửi lời thả thính đến ${event.mentions[mention].replace("@", "")}:\n${gai[Math.floor(Math.random() * gai.length)]}`, threadID, messageID);
    }
  }
  else {
    if (data.gender == 2) {
     api.sendMessage(`${trai[Math.floor(Math.random() * trai.length)]}`,threadID, messageID); 
    }
    if (data.gender == 1 ) {
     api.sendMessage(`${gai[Math.floor(Math.random() * gai.length)]}`, threadID, messageID);
    }
  }
  
     }
