const fs = require('fs');
const axios = require('axios');
const path = require('path');

module.exports = {
  config: {
    name: "rules",
    version: "1.0",
    author: "SK-SIDDIK-KHAN",
    countDown: 5,
    role: 0,
    category: "no prefix",
  },
 
  onStart: async function() {},

  onChat: async function({ event, message, api }) {
    if (event.body) {
      const word = event.body.toLowerCase();

      if (word === "rules") {
        try {
          const imagePath = path.join(__dirname, 'rules_image.jpeg');
          const response = await axios({
            url: "https://i.imgur.com/c4LniR9.jpeg",
            method: 'GET',
            responseType: 'stream',
          });

          response.data.pipe(fs.createWriteStream(imagePath)).on('close', async () => {
            await message.reply({
              body: `╭╼|━♡𝐒𝐈𝐃𝐃𝐈𝐊-𝐁𝐎𝐓-𝟎𝟕♡━|╾╮

✨আসসালামু আলাইকুম🖤💫

💬 1 - গ্রুপে কার সাথে বাজে ব্যবহার করা যাবে না, নাহলে গ্রুপ থেকে কিক দিবো-!!🥺

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 2 - পর্ণ কিংবা বাজে ভিডিও দেওয়া যাবে নাহ-!!💜🌸

☽︎━━━━━━━━━━━━━━━━━━☾︎
 
💬 3 - ছোট বড় সবার সাথে ভালো ব্যবহার করতে হবে-!!💚🌺 

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 4 - বড় হক কিংবা ছোট কাওকে ছোট করে কথা বলা যাবে নাহ-!!😽🌻 

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 5 - এখানে ইসলাম এর বাহিরে কোনো কথা বলা যাবে নাহ-!!🙂❤️‍🩹

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 6 - কারো সাথে কোনো রকমের ঝামেলা করা যাবে না _ কোনো সমস্যা হলে গ্রুপের Admin কে জানাবেন-!!🫡🥀

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 7 - গ্রুপে Admin বট থাকা সত্ত্বেও আর কোনো প্রকার বট অ্যাড করা যাবে না-!!😽🫵

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 8 - ১৮+ নিয়ে আসলে বা ১৮+ পর্ণ নিয়ে কোনো কথা বললে সাথে সাথে গ্রুপ থেকে বের করে দেওয়া হবে-!!🔥😽

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 9 - সকল ধর্ম লোক এখানে থাকতে পারবে - কারো ধর্ম যে নিয়ে কাওকে ছোট করা যাবে নাহ - এটা একটি শিক্ষণীয় বট এর থেকে সবাই আমারা ভালো  শিক্ষা নিতে আসেছি

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 10 - কেও এক ইমজি বার বার দিবেন নাহ - দয়া করে 🥺🥀

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 11 - গ্রুপ এর নাম  গ্রুপ পিক কিছু পরিবর্তন করা যাবে নাহ - একমাত্র এডমিন অনুমতি ছাড়া-!!✨🤗

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 12 - গ্রুপে কোন spam মেসেজ করা যাবে নাহ-!!😤🙏

☽︎━━━━━━━━━━━━━━━━━━☾︎

💬 13 - গ্রুপ এ কোন প্রোকার ফিসিং লিংক বা নাসা হেগার এর কোন  লিংক দেওয়া যাবেনা-!!🌸🫡

☽︎━━━━━━━━━━━━━━━━━━☾︎

৫ ওয়াক্তো নামাজ পরো আল্লাহ কে ডাকো - কেনো নাহ - হাসর এর ময়দানে  | বিচার এর কারবালায় এক মাত্রো আল্লাহ-ই- পারবেন তুমাকে জাহান্নামের সেই ভয়াবহ আগুন থেকে রক্ষা করতে 🥺🤲

☽︎━━━━━━━━━━━━━━━━━━☾︎

দোয়া রইলো তোমাদের জন্য প্রিয় গ্রুপ এর মেম্বার রা-!!❤️🤲

╰╼|━♡𝐒𝐈𝐃𝐃𝐈𝐊-𝐁𝐎𝐓-𝟎𝟕♡━|╾╯`,
              attachment: fs.createReadStream(imagePath),
            });

            fs.unlinkSync(imagePath);
          });

        } catch (error) {
          console.error("Error downloading or sending the image:", error);
          message.reply("⚠️ Could not load the image. Please try again later.");
        }
      }
    }
  }
};
